{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "1",
    "1": "2",
    "10": "B",
    "11": "C",
    "12": "D",
    "13": "E",
    "14": "F",
    "15": "G",
    "16": "H",
    "17": "I",
    "18": "J",
    "19": "K",
    "2": "3",
    "20": "L",
    "21": "M",
    "22": "N",
    "23": "O",
    "24": "P",
    "25": "Q",
    "26": "R",
    "27": "S",
    "28": "T",
    "29": "U",
    "3": "4",
    "30": "V",
    "31": "W",
    "32": "X",
    "33": "Y",
    "34": "Z",
    "4": "5",
    "5": "6",
    "6": "7",
    "7": "8",
    "8": "9",
    "9": "A"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "1": "0",
    "2": "1",
    "3": "2",
    "4": "3",
    "5": "4",
    "6": "5",
    "7": "6",
    "8": "7",
    "9": "8",
    "A": "9",
    "B": "10",
    "C": "11",
    "D": "12",
    "E": "13",
    "F": "14",
    "G": "15",
    "H": "16",
    "I": "17",
    "J": "18",
    "K": "19",
    "L": "20",
    "M": "21",
    "N": "22",
    "O": "23",
    "P": "24",
    "Q": "25",
    "R": "26",
    "S": "27",
    "T": "28",
    "U": "29",
    "V": "30",
    "W": "31",
    "X": "32",
    "Y": "33",
    "Z": "34"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2"
}
